In [2]:
import pandas as pd

data = {
    "Name": ["Ram", "Shyam", "Ghanshyam", "Aditi"],
    "Age": [25, 30, None, 28],  # Missing Age
    "Salary": [50000, None, 45000, 55000]  # Missing Salary
}

df = pd.DataFrame(data)
df

        Name   Age   Salary
0        Ram  25.0  50000.0
1      Shyam  30.0      NaN
2  Ghanshyam   NaN  45000.0
3      Aditi  28.0  55000.0